## 网络层

1. 网络层服务

- 功能：
  - 转发
  - 路由选择
  - 连接建立(分组交换网络)
    1. 仅在网络层提供连接服务： 虚电路（VC) 网络【通信之前，双方需要先建立虚电路（网络层逻辑连接）， 通信结束后再拆除虚电路】
    2. 仅在网络层提供无连接服务： 数据报网络【按照目的的主机地址进行路由选择的网络】

2. 数据报网络与虚电路网络的比较

|        项目         | 虚电路交换                                          |            数据报交换             |
| :-----------------: | --------------------------------------------------- | :-------------------------------: |
|     端到端连接      | 需要先建立连接                                      |          不需要建立连接           |
|        地址         | 每个分组含有一个短的虚电路号                        |    每个分组包含源和目的端 地址    |
|      分组顺序       | 按序发送，按序接收                                  |     按序发送，不一定按序接收      |
|      路由选择       | 建立 VC 时需要路由选择，之后 所有分组都沿此路由转发 |        对每个分组独立选择         |
| 转发结点失 效的影响 | 所有经过失效结点的 VC 终止                          | 除了崩溃时丢失分组外，无 其他影响 |
|      差错控制       | 由通信网络负责                                      |           由端系统负责            |
|      流量控制       | 由通信网络负责                                      |           由端系统负责            |
|      拥塞控制       | 若有足够的缓冲区分配给已经 建立的 VC，则容易控制    |           由端系统负责            |
|      状态信息       | 建立的每条虚电路都要求占用经过的每个结点的表空间    |        网络不存储状态信息         |
|      通信类型       | 传输质量要求高的通信                                |       数据通信，非实时通信        |
|      典型网络       | X.25、帧中继、ATM                                   |              因特网               |

3. 异构网络互连
   - 网络层 ： 路由器
   - 数据链路层： 交换机和网桥(交换机就是多端口的网桥，是目前应用最广泛的数据链路层设备。)
   - 物理层： 集线器和中继器
4. 拥塞控制措施
    - Ï流量感知路由： 将网络流量引导到不同的链路上，均衡网络负载，从而避免拥塞
发生。
    - 准入控制： 是一种广泛应用于虚电路网络的拥塞预防技术。审核新建虚电路，如果新虚电路会导致网络拥塞，那么网络拒绝建立该新虚电路。
    - 流量调节： 在网络发生拥塞时，可以通过调整发送方向网络发送数据的速率来消除拥塞。抑制分组、背压
    - 负载脱落： 通过有选择地主动丢弃一些数据报，来减轻网络负载，从而缓解或消除拥塞